nnm-t/stm32g051f8p6-visitor-counter/FATFS/Target/fatfs_sd.h
#pragma once

#include <stm32g0xx_hal.h>

#include "main.h"
#include "diskio.h"

#define CMD0                (0x40 + 0)
#define CMD1                (0x40 + 1)
#define CMD8                (0x40 + 8)
#define CMD9                (0x40 + 9)
#define CMD10               (0x40 + 10)
#define CMD12               (0x40 + 12)
#define CMD16               (0x40 + 16)
#define CMD17               (0x40 + 17)
#define CMD18               (0x40 + 18)
#define CMD23               (0x40 + 23)
#define CMD24               (0x40 + 24)
#define CMD25               (0x40 + 25)
#define CMD41               (0x40 + 41)
#define CMD55               (0x40 + 55)
#define CMD58               (0x40 + 58)

#define CT_MMC              0x01
#define CT_SD1              0x02
#define CT_SD2              0x04
#define CT_SDC              0x06
#define CT_BLOCK            0x08

typedef enum {
    SD_OK = 0,
    SD_ERROR = 1
} SD_Status;

SD_Status SD_spi_init(void);
SD_Status SD_disk_read_blocks(BYTE* buff, DWORD sector, UINT count);
SD_Status SD_disk_write_blocks(const BYTE* buff, DWORD sector, UINT count);
SD_Status SD_disk_read_multi(BYTE* buff, DWORD sector, UINT count);
SD_Status SD_disk_write_multi(const BYTE* buff, DWORD sector, UINT count);
uint8_t sd_is_sdhc(void);

extern uint8_t card_initialized;
extern SPI_HandleTypeDef    hspi1;

#define HSPI_SDCARD         &hspi1
#define SD_CS_PORT          SD_CS_GPIO_Port
#define SD_CS_PIN           SD_CS_Pin
